#include"head.h"
//全局变量声明
int sence;//用于存放场景图，0为主菜单，1为子菜单1（直接开始或选关），2为子菜单2（编辑界面），3为游戏界面，4为下一关界面，5为操作说明界面，6为游戏暂停界面
char key;//用来存放用户输入的值
char now;//编辑地图时用来存放选择项
int end;//用来存放游戏是否结束
int m_x[MAX_STAP][1], m_y[MAX_STAP][1];//用来存放人物坐标
int stap = 1;//用来记录步数
int next = 0;//用来判断是否下一关
int level = 2;//记录关卡
int box_num[MAX_STAP];//用来记录箱子数
int box_size;//用来做箱位计数器
char map[MAX_STAP][50][50] = { 0 };//用来存放游戏地图
int boxx[10];//用于存放箱子坐标
int boxy[10];
int box_x[10];//用于存放箱位坐标
int box_y[10];//
int map_i, map_j;//存放地图高和宽
struct custommap custom;
bool savecustommap = false;
bool loadcustommap = false;
char initmap[20][30] = {
					"\n\n\n\n\n",
					"\t\t\t\t-------------------",
					"\t\t\t\t-------------------",
					"\t\t\t\t||               ||",
					"\t\t\t\t||               ||",
					"\t\t\t\t|| 开始游戏（S） ||",
					"\t\t\t\t|| 操作说明（C） ||",
					"\t\t\t\t||               ||",
					"\t\t\t\t||   退出（Q）   ||",
					"\t\t\t\t||               ||",
					"\t\t\t\t||               ||",
					"\t\t\t\t-------------------",
					"\t\t\t\t-------------------"
};
char chosemap[20][30] = {
				"\n\n\n\n\n",
				"\t\t\t\t-------------------",
				"\t\t\t\t-------------------",
				"\t\t\t\t||               ||",
				"\t\t\t\t|| 从头开始（A） ||",
				"\t\t\t\t||  自定义（S）  ||",
				"\t\t\t\t||               ||",
				"\t\t\t\t||   退出（Q）   ||",
				"\t\t\t\t||               ||",
				"\t\t\t\t||               ||",
				"\t\t\t\t-------------------",
				"\t\t\t\t-------------------"
};
char shuoming[20][50] = {
				"\n\n\n\n\n",
				"\t\t\t\t--------------------------------------",
				"\t\t\t\t--------------------------------------",
				"\t\t\t\t||                                  ||",
				"\t\t\t\t|| 本游戏采用wsad分别向上下左右移动 ||",
				"\t\t\t\t||                                  ||",
				"\t\t\t\t||       返回上级菜单（ESC）        ||",
				"\t\t\t\t||                                  ||",
				"\t\t\t\t||            退出（Q）             ||",
				"\t\t\t\t||                                  ||",
				"\t\t\t\t--------------------------------------",
				"\t\t\t\t--------------------------------------"

};
//30*30的空的自定义地图
char custommap[50][50] = {
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
	"                              ",
};



int main(int *argc, char** argv)
{

	init();
	while (1)
	{

		event();
		update();
		render();
		delay();
		isend();
	}
	return 0;
}